# Pandas

In [1]:
import pandas as pd

## 1.Creating DataFrames

In [9]:
a=[('ram',1234,"sheripally"),
   ("mam",12,"raipole"),
   ("nav",657,"ramaram"),
  ("kar",768,"sheri"),
  ("chand",898,"sp"),
  ("wel",109,"weld"),
  ("ieoh",848,"duh"),
  ("ejioje",375,"ioejro")
  ]
df=pd.DataFrame(a,columns=["name","id","village"])
df

     name    id     village
0     ram  1234  sheripally
1     mam    12     raipole
2     nav   657     ramaram
3     kar   768       sheri
4   chand   898          sp
5     wel   109        weld
6    ieoh   848         duh
7  ejioje   375      ioejro

In [6]:
df.shape

(4, 3)

In [10]:
df.head()         #returns the first 5 rows

    name    id     village
0    ram  1234  sheripally
1    mam    12     raipole
2    nav   657     ramaram
3    kar   768       sheri
4  chand   898          sp

In [24]:
df.tail()

  name   id village
3    d  768   sheri
4    e  898      sp
5    f  109    weld
6    g  848     duh
7    h  375  ioejro

In [12]:
df[3:7]

    name   id village
3    kar  768   sheri
4  chand  898      sp
5    wel  109    weld
6   ieoh  848     duh

In [13]:
df.village

0    sheripally
1       raipole
2       ramaram
3         sheri
4            sp
5          weld
6           duh
7        ioejro
Name: village, dtype: object

In [14]:
df["name"]

0       ram
1       mam
2       nav
3       kar
4     chand
5       wel
6      ieoh
7    ejioje
Name: name, dtype: object

In [15]:
df["id"]

0    1234
1      12
2     657
3     768
4     898
5     109
6     848
7     375
Name: id, dtype: int64

In [16]:
df["id"].max()

1234

In [17]:
df.id.max()

1234

In [18]:
df.id.min()

12

In [19]:
df.describe()

                id
count     8.000000
mean    612.625000
std     417.460327
min      12.000000
25%     308.500000
50%     712.500000
75%     860.500000
max    1234.000000

In [20]:
df.id.describe()    #describes the statistical functions

count       8.000000
mean      612.625000
std       417.460327
min        12.000000
25%       308.500000
50%       712.500000
75%       860.500000
max      1234.000000
Name: id, dtype: float64

In [5]:
a=[('ram',1234,"sheripally"),
   ("mam",12,"raipole"),
   ("nav",657,"ramaram"),
  ("kar",768,"sheri"),
  ("chand",898,"sp"),
  ("wel",109,"weld"),
  ("ieoh",848,"duh"),
  ("ejioje",375,"ioejro")
  ]
df=pd.DataFrame(a,columns=["name","id","village"])
df

     name    id     village
0     ram  1234  sheripally
1     mam    12     raipole
2     nav   657     ramaram
3     kar   768       sheri
4   chand   898          sp
5     wel   109        weld
6    ieoh   848         duh
7  ejioje   375      ioejro

In [6]:
b=[('a',1234,"sheripally"),      #To concatinate 
   ("b",12,"raipole"),
   ("c",657,"ramaram"),
  ("d",768,"sheri"),
  ("e",898,"sp"),
  ("f",109,"weld"),
  ("g",848,"duh"),
  ("h",375,"ioejro")
  ]
df=pd.DataFrame(b,columns=["name","id","village"])
df

  name    id     village
0    a  1234  sheripally
1    b    12     raipole
2    c   657     ramaram
3    d   768       sheri
4    e   898          sp
5    f   109        weld
6    g   848         duh
7    h   375      ioejro

In [7]:
a.concat(b)

AttributeError: 'list' object has no attribute 'concat'